app/controllers/admin/cash_flows_controller.rb

SELECT `cash_flows`.* FROM `cash_flows` WHERE `cash_flows`.`company_id` = 4 LIMIT 15 OFFSET 0
---
    def index
      @cash_flows = current_user.company.cash_flows.page(params[:page]).per(15)