app/controllers/admin/users_controller.rb

    def index
      @users = current_user.is?(:admin) ? User : current_company.users
      @q = @users.search(params[:q])
      @users = @q.result.page(params[:page]).per(15)
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 15 OFFSET 0

    def find_user
      @user = if current_user.is?(:admin)
        User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 22 LIMIT 1