app/views/admin/cashflow_reports/_search.html.erb

      <%= "公司" %>
      <%= select_tag 'company_id', options_for_select(([[t('all'), '']] + Company.all.map { |c| [c.name, c.id] }), params[:company_id]), style: "width:160px" %>
---
SELECT `companies`.* FROM `companies`

      <%= "现金流科目" %>
      <%= select_tag 'cashflow_subject_id', options_for_select(([[t('all'), '']] + CashflowSubject.all.map { |s| [s.name, s.id] }), params[:cashflow_subject_id]), style: "width:160px" %>
---
SELECT `cashflow_subjects`.* FROM `cashflow_subjects`

      <%= "对应科目" %>
      <%= select_tag 'corresponding_subject_id', options_for_select(([[t('all'), '']] + CorrespondingSubject.all.map { |s| [s.name, s.id] }), params[:corresponding_subject_id]), style: "width:160px" %>
---
SELECT `corresponding_subjects`.* FROM `corresponding_subjects`