app/views/admin/users/index.html.erb

      </td>
      <td class="control span2"><%= user.roles.empty? ? t(:user, scope: "roles") : user.roles.map { |role| t(role, scope: "roles") }.join(', ') %></td>
---
SELECT COUNT(*) FROM `users`